{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_20": {"name": "keras_tensor_20:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_20", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/Relu", "op": "_FusedMatMul", "input": ["keras_tensor_20", "StatefulPartitionedCall/sequential_5_1/dense_15_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/dense_15_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5_1/dense_15_1/Relu", "StatefulPartitionedCall/sequential_5_1/dense_16_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/dense_16_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5_1/dense_16_1/Relu", "StatefulPartitionedCall/sequential_5_1/dense_17_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/dense_17_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_5_1/dense_17_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5_1/dense_17_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/Cast/ReadVariableOp", "shape": [7, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/BiasAdd/ReadVariableOp", "shape": [24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/Cast/ReadVariableOp", "shape": [24, 12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/BiasAdd/ReadVariableOp", "shape": [12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Cast/ReadVariableOp", "shape": [12, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}